const gender = [
  '男性',
  '女性',
  'その他',
];

const bloodTypes = [
  'A型',
  'B型',
  'O型',
  'AB型',
  'わからない',
];

const bodyTypes = [
  '痩せている',
  '普通',
  'ぽっちゃり',
];
const hairs = [
  '薄い',
  '普通',
  '濃い',
  '無い',
];

const marriages = [
  '既婚',
  '未婚',
  '離別・死別',
];

const personalities = [
  '優しい',
  '明るい',
  '面白い',
  '真面目',
  '誠実',
  '物静か',
  '人見知り',
  'マイペース',
];

const sociabilities = [
  '大人数が好き',
  '少人数が好き',
  '一人が好き',
];

const housemates = [
  '妻・夫',
  '子供',
  '孫',
  'ペット',
  'その他',
  'なし',
];

const alcohol = [
  '飲む',
  '飲まない',
  'ときどき飲む',
];

const cigarettes = [
  '吸わない',
  '相手に合わせる',
  '非喫煙者の前では吸わない',
  '吸う',
  '吸う(電子タバコ)',
  '葉巻',
];

const holiday = [
  '暦通り',
  '不定期',
  '平日',
  '毎日',
];

const house = [
  '持ち家(自己名義)',
  '持ち家(家族名義)',
  '官舎・社宅',
  '賃貸',
  '公営住宅',
  '住み込み・下宿',
];

const assets = [
  '現金預金',
  '有価証券',
  '土地・建物',
  '特許',
];

const walking = [
  '遅い',
  '普通',
  '早い',
];

const broAndSis = [
  'あり',
  'なし',
];

const prefectures = [
  '北海道',
  '青森',
  '岩手',
  '宮城',
  '秋田',
  '山形',
  '福島',
  '茨城',
  '栃木',
  '群馬',
  '埼玉',
  '千葉',
  '東京',
  '神奈川',
  '新潟',
  '富山',
  '石川',
  '福井',
  '山梨',
  '長野',
  '岐阜',
  '静岡',
  '愛知',
  '三重',
  '滋賀',
  '京都',
  '大阪',
  '兵庫',
  '奈良',
  '和歌山',
  '鳥取',
  '島根',
  '岡山',
  '広島',
  '山口',
  '徳島',
  '香川',
  '愛媛',
  '高知',
  '福岡',
  '佐賀',
  '長崎',
  '熊本',
  '大分',
  '宮崎',
  '鹿児島',
  '沖縄',
  '海外'
];

List<String> get heights =>
    List<String>.generate(66, (i) => '${i + 135}cm'); // 135 ~ 200
